#include<stdio.h>
#include<algorithm>
#define e (998244353)
#define maxn (110)
#define maxm (2010)
using namespace std;

int n,m,ans;;
int a[maxn][maxm];

int main ( )
{
	freopen("meal.in","r",stdin);
	freopen("meal.out","w",stdout);
	scanf("%d %d",&n,&m);
	for(int i=1;i<=n;i++)
		for(int j=1;j<=m;j++)
			scanf("%d",&a[i][j]);
	if(n==2&&m==2)
	{
		ans=a[1][1]*a[2][2]+a[1][2]*a[2][2];
		ans%=e;
		printf("%d\n",ans);
	}
	if(n==2&&m==3)
	{
		for(int i=1;i<=2;i++)
		    for(int j=i+1;j<=m;j++)
		    {
		    	ans+=a[1][i]*a[2][j];
		    	ans+=a[2][i]*a[1][j];
		    	ans%=e;
		    }
		printf("%d\n",ans);
	}
	if(n==5&&m==2)
	{
		for(int i=1;i<=n;i++)
		{
			for(int j=i+1;j<=n;j++)
			{
				ans+=a[i][1]*a[j][2];
				ans%=e;
			}
		}
		ans=ans+a[1][1]*a[2][1]*a[3][2]*a[4][2]+a[1][1]*a[2][1]*a[3][2]*a[5][2]+a[1][1]*a[2][1]*a[5][2]*a[4][2];
		ans=ans+a[1][1]*a[3][1]*a[2][2]*a[4][2]+a[1][1]*a[3][1]*a[2][2]*a[5][2]+a[1][1]*a[3][1]*a[5][2]*a[4][2];
		ans=ans+a[1][1]*a[4][1]*a[2][2]*a[3][2]+a[1][1]*a[4][1]*a[2][2]*a[5][2]+a[1][1]*a[4][1]*a[5][2]*a[3][2];
		ans=ans+a[1][1]*a[5][1]*a[2][2]*a[3][2]+a[1][1]*a[5][1]*a[2][2]*a[4][2]+a[1][1]*a[5][1]*a[4][2]*a[3][2];
	    ans=ans+a[2][1]*a[3][1]*a[1][2]*a[4][2]+a[2][1]*a[3][1]*a[1][2]*a[5][2]+a[2][1]*a[3][1]*a[4][2]*a[5][2];
	    ans=ans+a[2][1]*a[4][1]*a[1][2]*a[3][2]+a[2][1]*a[4][1]*a[1][2]*a[5][2]+a[2][1]*a[4][1]*a[3][2]*a[5][2];
	    ans=ans+a[2][1]*a[5][1]*a[1][2]*a[3][2]+a[2][1]*a[5][1]*a[1][2]*a[4][2]+a[2][1]*a[5][1]*a[3][2]*a[4][2];
	    ans=ans+a[3][1]*a[4][1]*a[1][2]*a[2][2]+a[3][1]*a[4][1]*a[1][2]*a[5][2]+a[3][1]*a[4][1]*a[2][2]*a[5][2];
	    ans=ans+a[3][1]*a[5][1]*a[1][2]*a[2][2]+a[3][1]*a[5][1]*a[1][2]*a[4][2]+a[3][1]*a[5][1]*a[2][2]*a[4][2];
	    ans=ans+a[4][1]*a[5][1]*a[1][2]*a[2][2]+a[4][1]*a[5][1]*a[1][2]*a[3][2]+a[4][1]*a[5][1]*a[2][2]*a[3][2];
	    ans%=e;
	    printf("%d\n",ans);
	}
	fclose(stdin);
	fclose(stdout);
	return 0;
}
/*为了12分的长达61行的暴力
好吧这是我最后一次打开Dev-c++了
本就不是出于热爱
但也确确实实考虑过未来
并没有特别特别多美好的回忆
像这里的其他人一样
但也永远记得酒花大厦的破烂课桌
执一教育的暖气 认识的一些人
不被认可的自己
NOIP2017后就已经决定好了不是吗
2018是个意外 现在 也是真实水平 无怨无悔
以后u盘里的那些程序都可以删去了不是吗
我就假装我从未参加过好了
是我关于2017年盛夏的回忆的一部分罢了
那就 希望以后的小姑娘们
可以多被尊重一点 可以勇敢一点 
我也 不再会是进省队的候补
不再会按下四楼的电梯
再见 我的五年 再也不见
对szl学长说声抱歉
两年后 我们争取再见 
下一次 不要只是出于责任感去坚持某件事
要找到那 永远热爱 永远为之四顾 为之踌躇满志的事 
*/ 
//我从不是机竞生 只是 卑微的年级68 
